## 데이터 분석
# - 데이터 수집
# - 데이터 가공
# - 데이터 시각화
# - 모델링 : 통계 모델링, 머신너링 모델링, 딥러닝 모델링
# - 통계를 도대체 어디까지 알아야 하나?
# - 선형대수를 얼마나 알아야 하나?
# - Top-Down 방식/ Bottom-up 방식
# - 모델링과 관련된 수식을 얼마나 알아야 하나?

# - 진로와 관련
# ex)웹 개발자 : 라이브러리 잘 가져다 쓰고, 배포 잘하면 끝
#    데이터 분석가(마케터, 여론조사, 연구원 등등) : 기획력이 중요
#      - 기본적인 통계 필요(교재 8장 통계 분석)
#
#      - 모수 검정 / 비모수 검정 --> 빈도주의
#      - 베이지안
#      - 시계열 분석
#
#    머신러닝 엔지니어 / 딥러닝 엔지니어
#      - 통계 / 선형대수 필요 / 모델링 수식 굳이 필요 없음
#      - 모형 만들고 배포를 잘해야 함(개발자)
#      - 포폴 : 머신러닝 논문 정리(최신), 라이브러리로 이미 만들어져 있음
#    리서쳐 : 알고리즘 직접 구현
#      - 최소 석사(관련 논문을 가지고 있음)
#      - 네이버, 카카오 AI
#      - 라이브러리를 직접 만드는 사람

# Top-Down 방식
#   - 분석의 방향(수치 예측/ 분류 위주 예측)
#   - 그룹간의 비교 / 인과관계
#   - 산업분야

# 172p~189p(8장) 숙제


